{
  "start": {
    "title": "Что не так с VN'ками?",
    "content": [
      "Стартовая страница, показывающая кусочки. Вместо того, чтобы быть документом в ^W Google Proton Docs.",
      ""
    ],
    "choices": [
      ["Псевдовариативность", "vars"],
      ["Пассаж про UX", "ux"],
      ["Геймплей на втором и следующих прохождениях", "secondrun"]
    ]
  },
  "vars": {
    "title": "Мимикрия под вариативность",
    "content": [
      "Слова про 'форк после каждого выбора --> см. с т.з. человекочасов' и 'взаимомутирующие друг в друга Ветви Сюжета'' вместо подробного описания решения.",
      "¯_(ツ)_/¯"
    ],
    "choices": [
      ["Какие варианты?", "todo"],
      ["Ничего не спасёт VN'ки", "start"]
    ]
  },
  "ux": {
    "title": "Про UI / UX",
    "content": [
      "Три строки текста, в половине случаев - скроллбар.",
      "Псевдо-интерактив в виде 'три раза нажми далее', чтобы зачем-то разбитое на части описание Уровня / Сцены, наконец-то прочитать полностью."
    ],
    "choices": [
      ["Какие варианты", "todo"],
      ["Ничего не спасёт VN'ки", "start"]
    ]
  },
  "secondrun": {
    "title": "Геймплей на втором и следующих прохождениях",
    "content": [
      "- Спидран вида 'далее - далее - далее', пока не дойдёшь до пока неизученной развилки - нуу такое.",
      "- Телепорт на экран вида 'Вот общая карта - выбирай конкретный Уровень' - нуу такое, хоть и частое решение. "
    ],
    "choices": [
      ["Несуществующая глава", "unwritten"],
      ["К началу", "start"]
    ]
  },
  "todo": {
    "title": "Что можно сделать? (вместо решения проблем, но добавления новых)",
    "content": [
      "- Рогаликовость",
      "- Минтить сейвы",
      "-- Каждый сейв - не_уникален с т.з. 'данный рут больше не доступен никому'",
      "--- С другой стороны, а чего теперь, не пускать следующего игрока по руту A2, B1, C3 если это уже отминчено предыдущим игроком? Или в чём уникальность конкретного сейва? Математически понятно, что разных сейвов - конечное количество. Потом, повторы. Т.е. вся 'награда' - это кто первый прошёл именно таким путём? Ну так можно такую статистику вести и без web3.",
      "-- Каждый сейв - уникален с т.з. 'данный рут больше не доступен никому'",
      "--- С ещё другой стороны, что-то есть и в идее 'каждый следующий ран - гарантированно не даст выбрать ранее выбранные опции', но зависит от реализации. Но тогда это вообще не Игра получается, а Событие с ограниченным количеством ранов, каждое следующее, скорее всего менее интерактивное и более скучное.",
      "- Сгорание ключа",
      "- Ран одного игрока VS другого",
      "-- Частично, продолжение идеи про доступность рута. С технической точки зрения, стоит ли как-то различать и закладывать в движок различия между N'ным раном одного игрока и M'ным другого? По идее, и сделать их идентичными, и разными - свои плюсы и минусы. В любом случае, получается геймдизайнерское высказывание. Решение на поверхности и очевидный антипаттерн: каждый новый ран --> покупка нового ключа к Игре. С намёком на 'ран должен быть единственным, лучше не покупай, прошёл один раз, прими свой выбор и последствия'. Но спорно и нуу такое. И это в диздоке-то, начинрающееся со слов про отсутствие вариативности."
    ],
    "choices": [
      ["Несуществующая глава", "unwritten"],
      ["К началу", "start"]
    ]
  }
}
